posts/docker-basics/docker-basics.html
<p>
Docker simplifies application deployment by containerizing your code and dependencies. Let’s look at the essential concepts that every developer should know.
</p>
<div id="outline-container-orgd945f67" class="outline-2">
<h2 id="orgd945f67">Images and Containers</h2>
<div class="outline-text-2" id="text-orgd945f67">
<p>
Lorem ipsum dolor sit amet, consectetur adipiscing elit. Suspendisse potenti. Fusce ullamcorper blandit diam vitae fermentum.
</p>
</div>
</div>
<div id="outline-container-org09505cf" class="outline-2">
<h2 id="org09505cf">Volumes and Networking</h2>
<div class="outline-text-2" id="text-org09505cf">
<p>
Aliquam erat volutpat. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas.
</p>
</div>
</div>
